// Авторы теста: ИСП РАН
// CWE: 824
// Название: Use of Uninitialized Pointer
// Модельный вариант: write-global.json
//
// Запись значения по неинициализированному глобальному указателю.
// Запись не производится, так как значение неинициализированного глобального
// указателя равно нулю.
//
// Поточный вариант: call-with-assign-false.c
// Достижимый путь от источника до стока с вызовом функции, которая присваивает
// значение через переданный указатель. Присвоенное значение сравнивается с
// константой, проверка успешна и выполнение завершается.

#include <stdlib.h>

int *x;

void callee(int *pointer_param) { *pointer_param = 492; }

void func(int *input_ptr) {

  int var = 0;

  callee(&var);

  if (var > 51) {
    exit(0);
  }

  if (x != NULL) {
    *x = -30;
  }
}
