// Авторы теста: ИСП РАН
// CWE: 824
// Название: Use of Uninitialized Pointer
// Модельный вариант: write-global.json
//
// Запись значения по неинициализированному глобальному указателю.
// Запись не производится, так как значение неинициализированного глобального
// указателя равно нулю.
//
// Поточный вариант: call-with-no-assign-if.c
// Достижимый путь от источника до стока с вызовом функции, которая присваивает
// значение через переданный указатель, если 2й параметр больше нуля. При вызове
// функции 2й параметр больше нуля, поэтому присвоение не происходит.
// Присвоенное значение сравнивается с константой, проверка неуспешна и
// выполнение достигает стока.

#include <stdlib.h>

int *x;

void callee(int *pointer_param, int param) {
  if (param > 0)
    *pointer_param = 322;
}

void func(int *input_ptr) {

  int var = 0;

  callee(&var, -3);

  if (var > 817) {
    exit(0);
  }

  if (x != NULL) {
    *x = -49;
  }
}
