// Авторы теста: ИСП РАН
// CWE: 120
// Название: Buffer Overflow
// Модельный вариант: basic-array-static-const_size-const_index-direct_ref.json
//
// Чтение за правой границей буфера.
// Буфер выделен в статической памяти.
// Буфер является обычным массивом.
// Размер буфера является константой.
// Доступ к буферу осуществляется непосредственно (с помощью операции
// индексации). Индекс является константой.
//
// Поточный вариант: pcall-int-value.c
// Достижимый путь от источника до стока с проверкой возвращаемого значения
// функции, которое зависит от локальной переменной, переданной в функцию по
// значению; возвращаемое из вызываемой функции значение больше 20, если
// параметр больше константы ([10;20]), поэтому проверка в вызывающей функции
// неуспешна и выполнение достигает стока. Вызов функции осуществляется по
// указателю.

#include <stdlib.h>

int result = 0;
int buffer[38];

int callee(int par1) {
  if (par1 > 54)
    return 20;

  return 10;
}

void func(void) {
  unsigned int index = 0;

  int local_var = 0;
  int (*func_ptr)(int) = &callee;

  index = 38;

  if (func_ptr(local_var) > 10) {
    exit(0);
  }

  result = buffer[index]; // FLAW

  return;
}
