// Авторы теста: ИСП РАН
// CWE: 120
// Название: Buffer Overflow
// Модельный вариант: basic-array-global-const_size-const_index.json
//
// Чтение за правой границей буфера.
// Буфер выделен в статической памяти.
// Буфер является обычным массивом.
// Размер буфера является константой.
// Доступ к буферу осуществляется непосредственно (с помощью операции
// индексации). Индекс является константой.
//
// Поточный вариант: call-with-no-assign-if.c
// Достижимый путь от источника до стока с вызовом функции, которая присваивает
// значение через переданный указатель, если 2й параметр больше нуля. При вызове
// функции 2й параметр больше нуля, поэтому присвоение не происходит.
// Присвоенное значение сравнивается с константой, проверка неуспешна и
// выполнение достигает стока.

#include <stdlib.h>

int buffer[37];

void callee(int *pointer_param, int param) {
  if (param > 0)
    *pointer_param = 418;
}

void func(void) {
  int result = 0;
  unsigned int index = 0;

  int var = 0;

  index = 37;

  callee(&var, -8);

  if (var > 989) {
    exit(0);
  }

  result = buffer[index]; // FLAW

  return;
}
