/*
Тест предложен командой разработчиков ООО "ПВС" (PVS-Studio), 2025
Примеры ошибок, классифицируемых как критические, согласно ГОСТ Р 71207—2024.
  6.3. б) Ошибки целочисленного переполнения и некорректного совместного использования знаковых и беззнаковых чисел.

Вариант потока управления, согласно ГОСТ Р 71207—2024 (пункты 6.7 а и 6.7.1 а):
 6.7. a) 1) прямолинейный участок кода;
Вариант потока данных, согласно ГОСТ Р 71207—2024 (пункты 6.7 б и 6.7.1 б):
 6.7. б) 1) поток данных заключен полностью в одной функции;

Детектор PVS-Studio: V1112. Comparing expressions with different signedness can lead to unexpected results.
Документация: https://pvs-studio.ru/ru/docs/warnings/v1112/
*/

#include <iostream>

bool FixGet46(bool x)
{
  signed char a = '\xEE';
  unsigned char b = '\xEE';
  if (x)
    b++;
  return (unsigned char)(a) == b;
}
